; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	image0 - mode
	thermograph2 - mode
	thermograph1 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star4 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 thermograph1)
	(supports instrument1 thermograph2)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 image0)
	(supports instrument2 thermograph1)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet6)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 image0)
	(supports instrument4 thermograph2)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon8)
)
(:goal (and
	(pointing satellite1 Star10)
	(have_image Phenomenon5 thermograph1)
	(have_image Planet6 thermograph2)
	(have_image Star7 thermograph2)
	(have_image Phenomenon8 image0)
	(have_image Star9 thermograph2)
	(have_image Star10 thermograph1)
	(have_image Planet11 thermograph1)
))

)

; plan
1. (turn_to satellite1 groundstation3 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 8
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 8
3. (calibrate satellite1 instrument4 groundstation3)
   added: (calibrated instrument4)
   goals met: 0 of 8
4. (turn_to satellite1 planet6 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet6)
   goals met: 0 of 8
5. (take_image satellite1 planet6 instrument4 thermograph2)
   added: (have_image planet6 thermograph2)
   goals met: 1 of 8
6. (turn_to satellite1 planet11 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet11)
   goals met: 1 of 8
7. (take_image satellite1 planet11 instrument4 thermograph1)
   added: (have_image planet11 thermograph1)
   goals met: 2 of 8
8. (turn_to satellite1 phenomenon8 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon8)
   goals met: 2 of 8
9. (take_image satellite1 phenomenon8 instrument4 image0)
   added: (have_image phenomenon8 image0)
   goals met: 3 of 8
10. (turn_to satellite1 phenomenon5 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon5)
   goals met: 3 of 8
11. (take_image satellite1 phenomenon5 instrument4 thermograph1)
   added: (have_image phenomenon5 thermograph1)
   goals met: 4 of 8
12. (turn_to satellite1 star7 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 star7)
   goals met: 4 of 8
13. (take_image satellite1 star7 instrument4 thermograph2)
   added: (have_image star7 thermograph2)
   goals met: 5 of 8
14. (turn_to satellite1 star9 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star9)
   goals met: 5 of 8
15. (take_image satellite1 star9 instrument4 thermograph2)
   added: (have_image star9 thermograph2)
   goals met: 6 of 8
16. (turn_to satellite1 star10 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star10)
   goals met: 7 of 8
17. (take_image satellite1 star10 instrument4 thermograph1)
   added: (have_image star10 thermograph1)
   goals met: 8 of 8
